In [2]:
# Importação das bibliotecas de manipulação de dados

import pandas as pd                                 # Manipulação de dados

In [3]:
# criação de um dicionário com dados

dados = {'emprego' : ['Adminstrador_de_banco_de_dados', 'Programador', 'Arquiteto_de_redes'],
         'nova_jersey' : [97_350, 82_080, 112_840],
         'florida' : [77_140, 71_540, 62_310]
         }

In [4]:
# tipo dos dados

type(dados)

dict

In [5]:
# transformando os dados de dicionario para um dataframe

dados = pd.DataFrame(dados)

In [6]:
# visualizando os dados

dados

                          emprego  nova_jersey  florida
0  Adminstrador_de_banco_de_dados        97350    77140
1                     Programador        82080    71540
2              Arquiteto_de_redes       112840    62310

In [7]:
# soma dos valores de cada coluna

dados['nova_jersey'].sum(), dados['florida'].sum()

(292270, 210990)

In [8]:
# criação de uma nova coluna com os percentuais

dados['%_nova_jersey'] = (dados['nova_jersey'] / dados['nova_jersey'].sum()) * 100
dados['%_florida']     = (dados['florida'] / dados['florida'].sum()) * 100

In [9]:
# visualizando os dados

dados

,emprego,nova_jersey,florida,%_nova_jersey,%_florida
0,Adminstrador_de_banco_de_dados,97350,77140,33.308242,36.560974
1,Programador,82080,71540,28.083621,33.906820
2,Arquiteto_de_redes,112840,62310,38.608136,29.532205